Revit 2027 API
StructuralSectionGeneralT.GetFlangeThicknessInQuarterWidth Method
 Returns thickness of flange measured in the 0.25 * width, sometimes used for sections with width <= 300 mm.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetFlangeThicknessInQuarterWidth()
Public Function GetFlangeThicknessInQuarterWidth As Double
public:
double GetFlangeThicknessInQuarterWidth()
member GetFlangeThicknessInQuarterWidth : unit -> float
Return Value
Double
See Also
Reference
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace